package jreport.swing.classes;

import java.util.ListResourceBundle;

public class Language
    extends ListResourceBundle {
    private static final Object[][] contents = new String[][] {
        {
        "String_11", "月"}, {
        "String_10", "年"}, {
        "String_9", "系统提示"}, {
        "String_8", "未找到匹配内容"}, {
        "String_6", "查找内容:"}, {
        "String_5", "替换所选"}, {
        "String_3", "关闭"}, {
        "String_2", "查找"}, {
        "String_1", "查找"}, {
        "String_32", "修改/增加校验公式"}, {
        "String_30", "检查报表时出错！\r\n原因："}, {
        "String_75", "系统提示"}, {
        "String_74", "条"}, {
        "String_73", "条匹配公式,成功替换"}, {
        "String_72", "找到"}, {
        "String_67", "系统提示"}, {
        "String_66", "条"}, {
        "String_65", "条匹配公式,成功替换"}, {
        "String_64", "找到"}, {
        "String_62", "系统提示"}, {
        "String_61", "未找到匹配内容"}, {
        "String_60", "系统提示"}, {
        "String_59", "未找到匹配内容"}, {
        "String_58", "系统提示"}, {
        "String_57", "当前活动单元格未找到匹配内容"}, {
        "String_56", "系统提示"}, {
        "String_55", "不合法,当前公式未被替换!"}, {
        "String_54", "替换后的公式"}, {
        "String_51", "系统提示"}, {
        "String_50", "不合法,当前公式未被替换!"}, {
        "String_49", "替换后的公式"}, {
        "String_47", "系统提示"}, {
        "String_46", "不合法,当前公式未被替换!"}, {
        "String_45", "替换后的公式"}, {
        "String_44", "系统提示"}, {
        "String_43", "不合法,当前公式未被替换!"}, {
        "String_42", "替换后的公式"}, {
        "String_41", "替换全部"}, {
        "String_39", "替换内容"}, {
        "String_38", "查找/替换"}, {
        "String_90", "系统提示"}, {
        "String_89", "不允许跨越不同的区域进行此操作！"}, {
        "String_88", "系统提示"}, {
        "String_87", "插入的新列数必须小于当前总列数！"}, {
        "String_86", "系统提示"}, {
        "String_85", "插入的新行数必须小于当前总行数！"}, {
        "String_81", "系统提示"}, {
        "String_654", "标准编码列表"}, {
        "String_653", "标准编码列表"}, {
        "String_652", "变动列设置"}, {
        "String_651", "变动区定义"}, {
        "String_650", "提示"}, {
        "String_649", "已经定义了变动列,不能再定义变动行 !"}, {
        "String_648", "提示"}, {
        "String_647", "已经定义了变动行,不能再定义变动列 !"}, {
        "String_645", "校验公式"}, {
        "String_623", "汇总选项"}, {
        "String_579", "<调整>"}, {
        "String_578", "<校验>"}, {
        "String_575", "<计算>"}, {
        "String_570", "提示"}, {
        "String_569", "没有此报表的公式定义权限！"}, {
        "String_568", "提示"}, {
        "String_567", "没有成本中心的公式定义权限！"}, {
        "String_566", "提示"}, {
        "String_565", "没有责任成本中心的公式定义权限！"}, {
        "String_564", "提示"}, {
        "String_563", "没有单位的公式定义权限！"}, {
        "String_562", "提示"}, {
        "String_561", "没有类别的公式定义权限！"}, {
        "String_560", "提示"}, {
        "String_559", "没有此报表的[单位修改]权限！"}, {
        "String_558", "提示"}, {
        "String_557", "公式已经封存，不能定义公式！"}, {
        "String_556", "该报表为下发报表，不能修改公式！"}, {
        "String_536", "<同左>"}, {
        "String_535", "<同左>"}, {
        "String_534", "<同上>"}, {
        "String_533", "<校验>"}, {
        "String_532", "<同左>"}, {
        "String_531", "<同左>"}, {
        "String_530", "<同上>"}, {
        "String_529", "<计算>"}, {
            "String_224", "系统提示"},  {
            "String_218", "自定义调整公式"}, {
            "String_217", "修改"},{
        "String_216", "报表"}, {
        "String_215", "保存"}, {
        "String_214", "保存报表格式"}, {
        "String_213", "自定义校验公式"}, {
        "String_212", "修改"}, {
        "String_211", "自定义计算公式"}, {
        "String_210", "修改"}, {
        "String_209", "修改格式校验公式"}, {
        "String_208", "修改格式计算公式"}, {
        "String_207", "修改格式调整公式"},{
        "String_204", "成本中心"}, {
        "String_192", "成本中心"}, {
        "String_189", "责任成本中心"}, {
        "String_201", "责任成本中心"}, {
        "String_198", "汇总类别"}, {
        "String_186", "汇总类别"}, {
        "String_196", "单位"}, {
        "String_184", "单位"}, {
        "String_194", "格式"}, {
        "String_182", "格式"}, {
        "String_135", "提示"}, {
        "String_134", "非系统报表，不能修改报表格式！"}, {
        "String_760", "计算结果"}, {
        "String_757", "计算结果"}, {
        "String_755", "单位审核校验报告"}, {
        "String_745", "成本中心编号"}, {
        "String_743", "成本中心名称"}, {
        "String_741", "成本中心编号"}, {
        "String_739", "责任成本中心名称"}, {
        "String_737", "责任成本中心编号"}, {
        "String_735", "责任成本中心名称"}, {
        "String_733", "责任成本中心编号"}, {
        "String_731", "单位名称"}, {
        "String_729", "单位编号"}, {
        "String_727", "单位名称"}, {
        "String_725", "单位编号"}, {
        "String_723", "类别名称"}, {
        "String_721", "类别编号"}, {
        "String_719", "类别名称"}, {
        "String_717", "类别编号"}, {
        "String_715", "公式"}, {
        "String_713", "差额"}, {
        "String_711", "值"}, {
        "String_709", "项目"}, {
        "String_707", "坐标"}, {
        "String_705", "报表名称"}, {
        "String_703", "报表编号"}, {
        "String_702", "成本报表校验报告"}, {
        "String_701", "责任成本中心报表校验报告"}, {
        "String_700", "单位报表校验报告"}, {
        "String_699", "类别报表校验报告"}, {
        "String_698", "报表校验报告"}, {
        "String_688", "单位名称"}, {
        "String_687", "单位编号"}, {
        "String_686", "审核公式"}, {
        "String_684", "提示信息"}, {
        "String_683", "公式说明"}, {
        "String_682", "公式类型"}, {
        "String_681", "报表名称"}, {
        "String_680", "报表编号"}
    };
    public Object[][] getContents() {
        return contents;
    }
}
