package com.efounder.object;

import javax.swing.*;

/**
 * Title:        Java Framework
 * Description:
 * Copyright:    Copyright (c) 2002
 * Company:      Pansoft Ltd.
 * @author Skyline
 * @version 1.0
 */
//--------------------------------------------------------------------------------------------------
//描述: 该类是本系统中所有可视对象的父类(不包括从JComponent以上层继承的类)
//      此类还实现了IDComInterface接口
//设计: Skyline(2002.04.22)
//实现: Skyline
//修改:
//--------------------------------------------------------------------------------------------------
public class JDComComponent extends JComponent implements IDComInterface,IDComObjectInformation {
    // 存放对象或接口的GUID
    protected String ObjectGUID;
    // 存放对象或接口的名称
    protected String ObjectName;
    //----------------------------------------------------------------------------------------------
    //描述: 该函数根据用户指定的GUID获取指定的接口
    //设计: Skyline(2001.12.29)
    //实现: Skyline
    //修改:
    //----------------------------------------------------------------------------------------------
    public Object QueryInterface(String guid) {
      if ( ObjectGUID == guid )
        return this;
      else
        return null;
    }
    //----------------------------------------------------------------------------------------------
    //描述:
    //设计: Skyline(2001.12.29)
    //实现: Skyline
    //修改:
    //----------------------------------------------------------------------------------------------
    public void setObjectGUID(String ObjectGUID) {
      this.ObjectGUID = ObjectGUID;
    }
    //----------------------------------------------------------------------------------------------
    //描述:
    //设计: Skyline(2001.12.29)
    //实现: Skyline
    //修改:
    //----------------------------------------------------------------------------------------------
    public void setObjectName(String ObjectName) {
      this.ObjectName = ObjectName;
    }
    //----------------------------------------------------------------------------------------------
    //描述: 该函数返回指定对象或接口的名称
    //设计: Skyline(2001.12.29)
    //实现: Skyline
    //修改:
    //----------------------------------------------------------------------------------------------
    public String getObjectName() {
      return ObjectName;
    }
    //----------------------------------------------------------------------------------------------
    //描述: 该函数返回指定对象或接口的GUID
    //设计: Skyline(2001.12.29)
    //实现: Skyline
    //修改:
    //----------------------------------------------------------------------------------------------
    public String getObjectGUID() {
      return ObjectGUID;
    }
    //----------------------------------------------------------------------------------------------
    //描述:
    //设计: Skyline(2001.12.29)
    //实现: Skyline
    //修改:
    //----------------------------------------------------------------------------------------------
    public int getInterfaceType() {
        return 0;
    }
    //----------------------------------------------------------------------------------------------
    //描述: 基础类的构造函数
    //设计: Skyline(2001.12.29)
    //实现: Skyline
    //修改:
    //----------------------------------------------------------------------------------------------
    public JDComComponent() {
    }
}
